package health.init;

import health.model.entity.Diet;
import health.model.entity.enums.TargetEnum;
import health.repository.DietRepository;
import health.service.UserService;
import org.springframework.boot.CommandLineRunner;
import org.springframework.stereotype.Component;

import java.util.List;

@Component
public class DietApplicationInit implements CommandLineRunner {

    private final DietRepository dietRepository;
    private final UserService userService;

    public DietApplicationInit(DietRepository dietRepository, UserService userService) {
        this.dietRepository = dietRepository;
        this.userService = userService;
    }

    @Override
    public void run(String... args) throws Exception {
        if(dietRepository.count() == 0){

            Diet diet1 = new Diet("Диетата на д-р Аткинс", userService.findByUsername("admin"),
                    TargetEnum.ОТСЛАБВАНЕ,
                    "Диетата за отслабване на д-р Аткинс е богата на протеини ," +
                            " близо 90% от всички вещества, и бедна на въглехидрати – 10%." +
                            " Как се прилагат тези пропорции в менюто, ще ви покажем чрез няколко примера." +
                    "Закуска: Бъркани яйца с шунка, чай или кафе без захар\n" +
                            "\n" +
                            "Обяд: Порция месо, например риба, на скара с малка салата\n" +
                            "\n" +
                            "Вечеря: Парче телешко и 1 печен домат.", 74);

            Diet diet2 = new Diet("Кетогенна диета", userService.findByUsername("admin"),
                    TargetEnum.ТОНИЗИРАНЕ,
                    "При кетогенната диета се увеличава приемът на мазнини, според сайта Здраве плюс.\n" +
                            "\n" +
                            "Намалява се приемът на въглехидрати и се свежда до минимум приемът на белтъчини. \n" +
                            "\n" +
                            "Причината е, че ниското количество въглехидрати в храната ще принуди черния дроб да трансформира мазнините в кетони.\n" +
                            "\n" +
                            "Кетоните са естествен заместител на глюкозата.", 8);

            Diet diet3 = new Diet("Вегетарианска диета", userService.findByUsername("admin"),
                    TargetEnum.ТОНИЗИРАНЕ,
                    "Вегетарианската диета се състои в това да не ядем месо, нито производни продукти, дори риба, в рамките на 11 дни.\n" +
                            "\n" +
                            "\n" +
                            "Набляга се на приема на плодове, зеленчуци, вода.\n" +
                            "\n" +
                            "Не се притеснявайте за протеините.\n" +
                            "\n" +
                            "Ако сте спортист или се занимавате редовно със спорт или други" +
                            " физически натоварвания, можете да спазвате тази диета без проблем.\n" +
                            "\n" +
                            "Вегетарианският хранителен режим включва основно зеленчуци, зърнени храни," +
                            " листни зеленчуци, плодове и ядки," +
                            " като животинските продукти са сведени до една порция" +
                            " нискомаслено кисело мляко дневно." ,3);

            Diet diet4 = new Diet("Диета „South Beach“", userService.findByUsername("admin"),
                    TargetEnum.ОТСЛАБВАНЕ,
                    "South Beach е иновативен режим, разработен от американския кардиолог д-р Артър Агатсън.\n" +
                            "\n" +
                            "\n" +
                            "Този режим помага в борбата с килограмите. South Beach е лесна и ефективна" +
                            " програма за здравословно хранене. Планът не налага ограничаване на храната," +
                            " броене на калории и глад – дори напротив. Вие сте сити и слабеете.",2);

            Diet diet5 = new Diet("Лунната диета", userService.findByUsername("admin"),
                    TargetEnum.ОТСЛАБВАНЕ,
                            "Лунната диета е течна диета, съобразена с лунните фази (новолуние," +
                            " първа четвърт, пълнолуние и последна четвърт). Спазва се 4 пъти в месеца." +
                            " Стартира при навлизане на Луната в определена фаза и завършва 24 часа по-късно. " +
                            "През това денонощие трябва да пиете много вода (3-4 литра), чай (без захар, може с мед)," +
                            " плодови или зеленчукови фрешове. Лунната диета е с доказана ефективност в " +
                            "свалянето на килограми, без странични действия. ",10);

            Diet diet6 = new Diet("Диетата GI", userService.findByUsername("admin"),
                    TargetEnum.НАПЪЛНЯВАНЕ,
                    "Диетата GI е базирана на гликемичния индекс. Той отразява промените на количеството " +
                            "глюкоза в кръвта" +
                            " под въздействието на въглехидратите. Идеята е да се консумират продукти с по-нисък GI, за " +
                            "да се контролира " +
                            "нивото на кръвната захар. Храните с нисък гликемичен индекс (плодове и зеленчуци, пълнозърнести" +
                            " храни, нетлъсто месо, риба) " +
                            "са естествено богати на фибри, нискокалорични и засищащи. Те автоматично водят до загуба на килограми.",5);

            Diet diet7 = new Diet("ВИСОКОЕНЕРГИЙНА ДИЕТА", userService.findByUsername("admin"),
                    TargetEnum.НАПЪЛНЯВАНЕ,
                    " Всеки ден трябва да имате три основни хранения плюс две или три допълнителни леки закуски. На" +
                            " някои от вас това ще се стори непосилно...," +
                            " но увеличаването на броя на храненията не означава, че трябва да консумирате допълнителни огромни" +
                            " количества храна. Последното хранене трябва" +
                            " да е леко и да е преди лягане, но не толкова, че да наруши съня ви. Между храненията не трябва да " +
                            "има интервали по-продължителни от 4 часа. *" +
                            " След физическите натоварвания не пийте вода, а други течности: гъсти плодови и зеленчукови сокове" +
                            " и млечни напитки. Съдържащата се в" +
                            " тях вода активира дейността на мускулите. ",7);

            Diet diet8 = new Diet("90-дневна диета", userService.findByUsername("admin"), TargetEnum.ОТСЛАБВАНЕ,
                    "90-дневната диета за разделяне на храната, е измислена от Бреда" +
                            " Хробат и Мойца Поляншек от Словения и тя се различава от много други планове за отслабване " +
                            "не само с нейната продължителност, но и със завидното разнообразие в менюто.\n" +
                            "\n" +
                            "Авторите се стремят да направят метаболизма по-добър и да го обучат на определена дисциплина" +
                            " в областта на храненето, но не се стремят да лишат хората от гастрономически удоволствия.",1);

            Diet diet9 = new Diet("Житната диета на Петър Дънов", userService.findByUsername("admin"), TargetEnum.ОТСЛАБВАНЕ,
                    "Представлява десетдневен хранителен режим, който ще пречисти духът ви, тялото ви и ще ви " +
                            "помогне да имате много повече енергия, да заразявате всички около вас с положителни емоции" +
                            " и да бъдете здрави.\n" +
                            "\n" +
                            "Едно такова пречистване ще ви освободи от излишните бактерии, стрес, но също така и ще " +
                            "свалите няколко килограма.\n" +
                            "\n" +
                            "\n" +
                            "Житната диета на Петър Дънов е един десетдневен хранителен режим\n" +
                            "Все пак трябва да имате предвид някои факти:\n",1);

            Diet diet10 = new Diet("Диета на Дюкан", userService.findByUsername("admin"), TargetEnum.ОТСЛАБВАНЕ,
                    "За разлика от други високобелтъчни диети, този план се фокусира върху източници на постно белтъчно" +
                            " съдържание, като се избягват тези с мазнини.\n" +
                            "\n" +
                            "Недостатъкът е, че този план не ви учи на здравословни навици  през целия живот. Още по-проблематично," +
                            " препоръчва да останете във фазата на консолидация, докато не достигнете целта си. Ако трябва да свалите" +
                            " много килограми, тази фаза може да продължи месеци или дори години.",1);

            dietRepository.saveAll(List.of(diet1, diet2, diet3, diet4, diet5, diet6, diet7, diet8, diet9, diet10));
        }
    }
}
