package health.init;

import health.model.entity.Recipe;
import health.model.entity.enums.RecipeEnum;
import health.repository.RecipeRepository;
import health.service.UserService;
import health.service.impl.RecipeServiceImpl;
import org.springframework.boot.CommandLineRunner;
import org.springframework.stereotype.Component;

@Component
public class RecipesApplicationInit implements CommandLineRunner {

    private final RecipeRepository recipeRepository;
    private final RecipeServiceImpl recipeServiceImpl;
    private final UserService userService;

    public RecipesApplicationInit(RecipeRepository recipeRepository, RecipeServiceImpl recipeServiceImpl, UserService userService) {
        this.recipeRepository = recipeRepository;
        this.recipeServiceImpl = recipeServiceImpl;
        this.userService = userService;
    }

    @Override
    public void run(String... args) throws Exception {

        if (recipeRepository.count() == 0) {



            Recipe recipe1 = new Recipe("Рулца от патладжан с орехов пълнеж",
                    RecipeEnum.ОСНОВНО, "3 средно големи патладжана;" +
                    " 150 грама или 1 1/2 чаши орехи;" +
                    " 100 ml или 1/2 чаша много гореща вода," +
                    " 2 скилидки чесън смлени;" +
                    " 2 чаени лъжички оцет от бяло вино;" +
                    " 3 супени лъжици семена от нар за сервиране;" +
                    " грузинска подправка хмели-сунели ( може да се замени с;" +
                    "друг микс по вкус);" +
                    " 1 нар",
                    40,
                    200,
                    "Нарежете патладжаните на тънки ленти и ги изпечете на 180 градуса във фурна с малко зехтин;" +
                            "Междувременно пригответе пълнежа: натрошете орехите с хаванче или в чопър;" +
                            "Добавете смления чесън, хмели сунели, оцет от бяло вино, сол и черен пипер;" +
                            "Смесете всичко и бавно добавете гореща вода в купата, като бъркате непрекъснато, докато" +
                            "консистенцията ви хареса.;Не изливайте цялата вода наведнъж, тъй като може да не ви трябва" +
                            "точно това количество;" +
                            "Украсете със семена от нар по желание.",
                    100,
                    "/images/recipe/main/Рулца от патладжан с орехов пълнеж.jpg",
                    userService.findByUsername("admin"))
                    .setTarget(recipeServiceImpl.findRecipeTypeByCalories(200));

            Recipe recipe2 = new Recipe("Здравословен крем с извара , заквасена сметана и ягоди", RecipeEnum.ДЕСЕРТ,
                    " 200-300гр. извара\n;" +
                             " 300гр. заквасена сметана\n;" +
                             " кафява захар , агаве , мед или сладко от ягоди\n;" +
                             " пресни ягоди", 50,
                    400,
                    "Разбърквате изварата ,сметаната и подсладителя.\n" +
                            "Насипвате в купички за десерт и декорирате с ягодите и мента по избор",
                    80,
                    "/images/recipe/dessert/Здравословен крем с извара.jpg",
                    userService.findByUsername("admin")).
                    setTarget(recipeServiceImpl.findRecipeTypeByCalories(400));

            Recipe recipe3 = new Recipe("Салата детокс с киноа и зеленчуци", RecipeEnum.ПРЕДЯСТИЕ,
                    "сварена киноа;" +
                            "бейби спанак;" +
                            "100-200гр. сладка царевица;" +
                            "червен боб консерва Rapunzel 400 гр;" +
                            "чери домати;" +
                            "зехтин на вкус;" +
                            "сока от 2 лайма;" +
                            "една връзка магданоз;" +
                            "сол на вкус",
                    80,
                    170,
                    "Нарязвате съставките, след което овкусявате.; Готово за консумиране.",
                    240,
                    "/images/recipe/starter/Салата детокс с киноа и зеленчуци.jpg",
                    userService.findByUsername("admin")).
                    setTarget(recipeServiceImpl.findRecipeTypeByCalories(170));

            Recipe recipe4 = new Recipe("Здравословен авокадо тост", RecipeEnum.ВЕГЕТАРИАНСКО,
                    " 1 голям кръгъл сладък картоф, нарязан по дължина на дълги филийки\n;" +
                            " 1 чаена лъжичка масло от авокадо\n;" +
                            " 1 авокадо, пасирано\n;" +
                            " яйце ; чери домати ; лук за различните видове тост;",
                    30,
                    154,
                    "Запечете филийките сладък картоф ,като преди това ги поръсите с авокадово масло\n" +
                            "до придобиване на златиста коричка.\n;" +
                            "След това декорирайте филийките по желание с яйце , червен лук , чери домати , ягоди.",
                    102,
                    "/images/recipe/vegetarian/Здравословен авокадо тост.jpg",
                    userService.findByUsername("admin")).
                    setTarget(recipeServiceImpl.findRecipeTypeByCalories(154));

            Recipe recipe5 = new Recipe("Кокосови сурови топчета", RecipeEnum.ДЕСЕРТ,
                    " 1 1/2 чаши неподсладени кокосови стърготини\n;" +
                            " 2 с.л. кокосов крем (ако нямате това, не се притеснявайте! просто добавете още кокосови стърготини)\n;" +
                            " 3 супени лъжици кокосов сироп, сироп от фурми или друг полезен подсладител, който имате\n;" +
                            " 1 ч.л. екстракт от ванилия\n;" +
                            " 1 ч.л. лимонови кори\n;" +
                            " 1 ч.л. бадемово мляко\n;" +
                            " щипка сол\n;" +
                            " допълнително кокосови стърготини за овалване",
                    40,
                    271,
                    "Разбиваме яйцата, след което ги слагаме в предварително загрят тиган; Бъркаме постоянно до готовност.",
                    300,
                    "/images/recipe/dessert/Кокосови сурови топчета.jpg",
                    userService.findByUsername("admin")).
                    setTarget(recipeServiceImpl.findRecipeTypeByCalories(271));

            Recipe recipe6 = new Recipe("Чийзкейк с бисквити от спелта, бадеми и мед", RecipeEnum.ДЕСЕРТ,
                    " 200 гр. бисквити от спелта Alce Nero\n;" +
                            " 1 лъжица филиран бадем\n;" +
                            " 100 гр. масло при стайна температура\n;" +
                            " 500 гр. заквасена сметана\n;" +
                            " 500 гр. крема сирене\n;" +
                            " 2 яйца\n;" +
                            " 1 необработен лимон\n;" +
                            " 240 гр. мед\n;" +
                            " настъргана лимонова кора",
                    35,
                    194,
                    " Използвайте блендер, за да смесите маслото и бисквитите.\n;" +
                            " Застелете дъното на 20 см форма, за предпочитане отваряща се, с хартия за печене и разпределете сместа върху нея.\n;" +
                            " Оформете бисквитите с лъжица, за да образувате компактен и еднороден слой.\n;" +
                            " В купа смесете киселото мляко със заквасената сметана, 200 гр. мед, 2-те яйца и настърганата лимонова кора.\n;" +
                            " Разбъркайте и изсипете сместа върху слоя бисквити; Печете в предварително загрята фурна на 160° за около 50-60 минути, до златисто.\n;" +
                            " Междувременно препечете бадемовите парченца в незалепващ тиган.\n;" +
                            " Добавете останалия мед и разбъркайте; Сервирайте чийзкейка студен и гарниран с останалия мед и бадеми.",
                    74,
                    "/images/recipe/dessert/Чийзкейк с бисквити от спелта, бадеми и мед.jpg",
                    userService.findByUsername("admin"))
                    .setTarget(recipeServiceImpl.findRecipeTypeByCalories(194));

            Recipe recipe7 = new Recipe("Сладолед с авокадо", RecipeEnum.ВЕГЕТАРИАНСКО,
                    " 2 бр. авокадо\n;" +
                            " сок от 1 лимон\n;" +
                            " листенца мента\n;" +
                            " БИО Кокосово мляко Rapunzel 200 мл.\n;" +
                            " БИО Кокосов сироп Rapunzel 250 гр;",
                    50,
                    266,
                    "В блендер смесвате всички съставки, за да стане като зелено смути.\n;" +
                            "Може да добавите шам фъстък и листенца мента, като декорация.\n;" +
                            "Замразете във фризера за около 4 часа и това лятно изкушение е готово да ви разхлади в горещите дни;",
                    220,
                    "/images/recipe/vegetarian/Сладолед с авокадо.jpg",
                    userService.findByUsername("admin"))
                    .setTarget(recipeServiceImpl.findRecipeTypeByCalories(266));

            Recipe recipe8 = new Recipe("Мъфини с яйца, спанак и гъби", RecipeEnum.ОСНОВНО,
                    " яйца\n;" +
                            " бейби спанак\n;" +
                            " гъби\n;" +
                            " чушки\n;" +
                            " гауда\n;" +
                            " сол на вкус\n",
                    60,
                    202,
                    " Приготвянето на тези здравословни мъфини за закуска е супер лесно; Започнете с предварително загряване на фурната и разбиване на яйцата в голяма купа.\n;" +
                            " Нарежете чушките и гъбите на малки парченца и настържете гаудата. След това ги добавете в сместта.\n;" +
                            " Добавете бейби спанака и разбъркайте леко.\n;" +
                            " Добавете мащерка и сол на вкус.\n;" +
                            " Печете във фурната на 180 градуса до готовност.;",
                    150,
                    "/images/recipe/main/Мъфини с яйца, спанак и гъби.jpg",
                    userService.findByUsername("admin"))
                    .setTarget(recipeServiceImpl.findRecipeTypeByCalories(202));

            Recipe recipe9 = new Recipe("Супер закуска", RecipeEnum.ОСНОВНО,
                    " Кисело мляко\n;" +
                            " Плодове - ягоди, малини, къпини\n;" +
                            " Овесени ядки\n;" +
                            " Чия семена\n;" +
                            " Орехи\n;" +
                            " Бадеми\n;" +
                            " Червени боровинки;",
                    80,
                    145,
                    " Прави се от вечерта. Просто се смесват всички съставки и се слагат в хладилника до сутринта.",
                    174,
                    "/images/recipe/starter/Супер закуска.jpg",
                    userService.findByUsername("admin"))
                    .setTarget(recipeServiceImpl.findRecipeTypeByCalories(145));

            Recipe recipe10 = new Recipe("Суров чийзкейк с череши", RecipeEnum.ДЕСЕРТ,
                    " ½ чаша лешници\n;" +
                            " ½ чаша смлени бадеми\n;" +
                            " ½ чаша накиснати фурми без костилка Rapunzel, нарязани\n;" +
                            " 1 супена лъжица кокосово масло Rapunzel\n;" +
                            "\n" +
                            "За крема:\n;" +
                            "\n" +
                            " 1 ½ чаша пресни череши\n;" +
                            " ½ чаша предварително накиснато кашу\n;" +
                            " ¼ чаша агаве нектар Primeal\n;" +
                            " 1 супена лъжица кокосово масло Rapunzel\n;" +
                            " 1 супена лъжица лимонов сок",
                    60,
                    320,
                    "Смесваме съставките за крема и блата; Поставяме блата в една тава, след което отгоре намазваме крема.",
                    147,
                    "/images/recipe/dessert/Суров чийзкейк с череши.jpg",
                    userService.findByUsername("admin"))
                    .setTarget(recipeServiceImpl.findRecipeTypeByCalories(320));

            Recipe recipe11 = new Recipe("Сурови топчета с малини", RecipeEnum.ДЕСЕРТ,
                    " 200 гр. кашу ( предварително накиснато за няколко часа)\n;" +
                            " 7 броя фурми\n;" +
                            " 3 с.л. мед\n;" +
                            " 3 с.л. кокосов крем или кокосово масло\n;" +
                            " кокосови стърготини или сушени малини на прах за овалване\n;" +
                            " замразени малини ,които се слагат вътре в бонбоните",
                    40,
                    144,
                    "Сложете кашуто ,фурмите ,кокосовото масло и меда в чопър и ги смелете ,докато се получи хомогенна смес.;" +
                            " Трябва да е гъста и леко лепкава . От тази смес се оформят топчета ,като в средата се слага замразена малинка;" +
                            " Вместо малини може да се сложат боровинки или малки горски ягоди; Плодовете трябва да са замразени, " +
                            " защото така се оформят по-лесно ,иначе може да станат на каша в ръцете ,докато се оформя топчето;" +
                            " Готовите топчета се овалват в кокосови стърготини или сушени малини на прах.;" +
                            " Така готовите бонбони се съхраняват в хладилник; Чудесен десерт са и за децата в училище, " +
                            "защото само няколко бонбона засищат и дават енергия.",
                    147,
                    "/images/recipe/dessert/Сурови топчета с малини.jpg",
                    userService.findByUsername("admin"))
                    .setTarget(recipeServiceImpl.findRecipeTypeByCalories(144));

            Recipe recipe12 = new Recipe("Здравословен вариант на любимата баклава", RecipeEnum.ДЕСЕРТ,
                    " 1 пакет кори за баница\n;" +
                            " 2 парчета масло или ⅔ чаша кокосово масло\n;" +
                            " 1 чаша шам фъстък, начупен\n;" +
                            " 1 чаша орехи, начупени\n;" +
                            " 1 чаша пекан, начупен\n;" +
                            " 1 ч.л. канела\n;" +
                            " 1 ч.л. индийско орехче\n;" +
                            "\n" +
                            " За сиропа:\n;" +
                            " ⅔ чаша захар\n;" +
                            " ½ чаша мед\n;" +
                            " 2 с.л. пресен лимонов сок\n;" +
                            " ½ чаша филтрирана вода\n;" +
                            " ½ ч.л. канела\n;" +
                            " ½ ч.л. индийско орехче\n;" +
                            " ½ чаша смлени ядки за гарниране;",
                    30,
                    177,
                    " Загрейте фурната на 180 градуса\n" +
                            "Разтопете маслото, като първо намажете с него съда, в който ще приготвяте баклавата\n;" +
                            "Сложете три листа от корите, поръсете с разтопеното масло и покрийте с натрошени ядки\n;" +
                            "Сложете още два листа, като отново покриете с масло и ядки и продължете, докато останат 7 листа\n;" +
                            "Завършете с последните листи, като мажете всеки от тях с масло\n;" +
                            "С много остър нож нарежете баклвата на триъгълници\n;" +
                            "Сложете във фурната и печете за 40-50 минути или до покафеняване\n;" +
                            "Докато се пече, в малък тиган комбинирайте всички съставки за сиропа\n;" +
                            "Сложете да ври на средна температура, като разбърквате до разтварянето на захарта, след това намалете печката и оставете да къкри за 3 минути\n;" +
                            " Махнете от котлона и оставете да се охлади\n;" +
                            " Когато баклавата е готова, бавно изсипете сиропа върху нея\n;" +
                            " Поръсете с останалото от натрошените ядки и оставете да попие поне за 5 часа;",
                    147,
                    "/images/recipe/dessert/Здравословен вариант на любимата баклава.jpg",
                    userService.findByUsername("admin"))
                    .setTarget(recipeServiceImpl.findRecipeTypeByCalories(177));

            Recipe recipe13 = new Recipe("Сурова веган торта с боровинки", RecipeEnum.ДЕСЕРТ,
                    " 100 гр. сушени, меки кайсии\n;" +
                            " една чаена чаша орехи\n;" +
                            " щипка сол\n;" +
                            "\n" +
                            "За крема:\n;" +
                            "\n" +
                            " шепа пресни листа от мащерка",
                    90,
                    442,
                    "Пригответе форма с диаметър 18 см. и поставете парче пергаментна хартия в дъното на тортата.\n;" +
                            "Блендирайте до хомогенност съставките за основата; Готовото тесто разстелете равномерно върху хартията и притиснете с лъжица, за да е плътно.\n;" +
                            "Поставете всички съставки за пълнене (с изключение на боровинки и мащерка) в процесора / смесителя на храната и сместа до гладка.;" +
                            " Добавете малко мляко без мляко, ако е необходимо, за да получите гладка текстура, като същевременно я държите колкото е възможно по-дебела.\n;" +
                            "\n" +
                            "За крема - смесете всички необходими съставки в блендера (без боровинките и мащерката) и блендирайте до получаване на гладка, " +
                            "кремообразна смес.; При необходимост добавете бадемовото мляко, но се старайте сместа да остане гъста и да не стане прекалено рядка.\n;" +
                            "\n" +
                            "Изсипете около 1/3 от сместа върху основата, а към останала смес добавете боровинките и мащерката. ;" +
                            "Блендирайте и добавете и 2-рата част от крема.\n;" +
                            "\n" +
                            " Декорирайте с боровинките и мащерката.; Поставете тортата във фризера за около 2-3 часа или докато се стегне добре.;",
                    147,
                    "/images/recipe/dessert/Сурова веган торта с боровинки.jpg",
                    userService.findByUsername("admin"))
                    .setTarget(recipeServiceImpl.findRecipeTypeByCalories(442));

            Recipe recipe14 = new Recipe("Кекс с череши и банани без захар", RecipeEnum.ДЕСЕРТ,
                    " 3 яйца\n" +
                            " 6 с. лъжици сироп от фурми\n;" +
                            " 1 с.л. мед\n;" +
                            " 1 чаена чаша бяло брашно , пресято през сито\n;" +
                            " 1 банан , нарязан на парчета\n;" +
                            " Около 100 грама череши, почистени от костилките\n;" +
                            " 1 ч.л. бакпулвер\n;" +
                            " по желание ванилов сладолед или маскаропоне с плодове;",
                    60,
                    285,
                    " Разбивате яйцата и подсладителите на сняг с миксер.\n;" +
                            " Добавяте брашното и бакпулвера и разбърквате с дървена шпатула бавно и внимателно\n" +
                            "докато стане хомогенно.\n;" +
                            " Изсипете в тава покрита с хартия за печене и добавете банана и черешите равномерно\n" +
                            "върху сместа .\n;" +
                            " Печете в предварително загрята фурна на 180 градуса до суха клечка.\n;" +
                            "\n" +
                            "Поднесете с топка ванилов сладолед или маскарпоне с плодове. Може да се направи и във форма за мъфини.;",
                    147,
                    "/images/recipe/dessert/Кекс с череши и банани без захар.jpg",
                    userService.findByUsername("admin"))
                    .setTarget(recipeServiceImpl.findRecipeTypeByCalories(285));

            Recipe recipe15 = new Recipe("Кестеново-тиквена супа", RecipeEnum.ПРЕДЯСТИЕ,
                    "4 с.л. масло\n;" +
                            "2 средни глави лук, нарязани на едро\n;" +
                            "8 или повече чаши бульон\n;" +
                            "1.8 кг тиква, изпечена и нарязана на 2.4 см кубчета\n;" +
                            "6 големи картофи, нарязани на 2.5 см кубчета;\n" +
                            "1 буркан (450 мл) белени кестени;\n" +
                            "Сол и пипер\n;" +
                            "До 2 супени лъжици сметана\n;" +
                            "Тиквени семена за гарниране;",
                    60,
                    298,
                    " Разтопете маслото в голяма тенджера при умерено ниска топлина.; Добавете лука," +
                            " тиквата, картофите и кестените, докато зеленчуците омекнат, за около 45 минути.; Оставете малко да се охлади.\n" +
                            "\n;" +
                            "Сложете сместа в кухненския робот до получаване на гладка течност.; Подправете със сол и черен пипер.;" +
                            " Точно преди сервиране, разбъркайте със сметана на вкус и гарнирайте с тиквени семки," +
                            " ако желаете.",
                    147,
                    "/images/recipe/starter/Кестеново-тиквена супа.jpg",
                    userService.findByUsername("admin"))
                    .setTarget(recipeServiceImpl.findRecipeTypeByCalories(298));

            recipeRepository.save(recipe1);
            recipeRepository.save(recipe2);
            recipeRepository.save(recipe3);
            recipeRepository.save(recipe4);
            recipeRepository.save(recipe5);
            recipeRepository.save(recipe6);
            recipeRepository.save(recipe7);
            recipeRepository.save(recipe8);
            recipeRepository.save(recipe9);
            recipeRepository.save(recipe10);
            recipeRepository.save(recipe11);
            recipeRepository.save(recipe12);
            recipeRepository.save(recipe13);
            recipeRepository.save(recipe14);
            recipeRepository.save(recipe15);

        }
    }
}
